# VectorFillList

## Description
Function VectorFillList returns the name of the specified vector fill definition.

```pascal
FUNCTION VectorFillList(index : LONGINT): STRING;
```

```python
def vs.VectorFillList(index):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|index|LONGINT|Index ID of vector fill (in a range of 1 - n).|

## Remarks
Returns the name of the specified hatch definition from the active document.

## Examples
```pascal
resultStr := VectorFillList(1);
```
```python
import vs

# Function VectorFillList returns the name of the specified vector fill
# definition.
index = 1

text = vs.VectorFillList(index)
vs.Message('VectorFillList returned: ' + str(text))
```

## Version
Availability: from MiniCAD7.0.1

## Category
* Hatches @ Vector Fills